Examinator/src/Enums/ТипыШаблоновСообщенийСУО/ТипыШаблоновСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблоновСообщенийСУО</name>
  <enumValues>
    <name>АвтоматическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>РучнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СбросПароля</name>
  </enumValues>
  <enumValues>
    <name>ОбъединениеДубликатовПользователей</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыШаблоновСообщенийСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	ДанныеВыбора = Новый СписокЗначений;
	
	Элемент = ДанныеВыбора.Добавить();
	Элемент.Значение = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка;
	Элемент.Представление = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка;	
	
	Элемент = ДанныеВыбора.Добавить();
	Элемент.Значение = Перечисления.ТипыШаблоновСообщенийСУО.РучнаяРассылка;
	Элемент.Представление = Перечисления.ТипыШаблоновСообщенийСУО.РучнаяРассылка;	
	
	Элемент = ДанныеВыбора.Добавить();
	Элемент.Значение = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля;
	Элемент.Представление = Перечисления.ТипыШаблоновСообщенийСУО.СбросПароля;		
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
